# Introduction to Pandas

We can consider pandas as a powerful version of Excel, with a lot more features.

**Part I**
* Series
* DataFrames
* Missing Data

**Part II**
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

# 1. Series

A Series is similar to a NumPy array. What differentiates the NumPy array from a Series, is that a Series can have axis labels; that is, it can be indexed by a label, instead of a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['A','B','C','D']
my_list = [5,10,15,20]
arr = np.array([5,10,15,20])
d = {'A':5,'B':10,'C':15,'D':20}

In [3]:
pd.Series(data=my_list)

0     5
1    10
2    15
3    20
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

A     5
B    10
C    15
D    20
dtype: int64

In [5]:
pd.Series(my_list,labels)

A     5
B    10
C    15
D    20
dtype: int64

In [6]:
# NumPy Arrays

pd.Series(arr)

0     5
1    10
2    15
3    20
dtype: int64

In [7]:
pd.Series(arr,labels)

A     5
B    10
C    15
D    20
dtype: int64

In [8]:
# As Dictionary

pd.Series(d)

A     5
B    10
C    15
D    20
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [9]:
pd.Series(data=labels)

0    A
1    B
2    C
3    D
dtype: object

## Using an Index

The key in using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information.

In [12]:
ser1 = pd.Series([1,2,3,4],index = ['India', 'UK','USSR', 'China'])         
ser1

India    1
UK       2
USSR     3
China    4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,5,4],index = ['India', 'UK','Italy', 'China'])     
ser2

India    1
UK       2
Italy    5
China    4
dtype: int64

In [16]:
ser1['India']

1

In [19]:
ser1 + ser2

China    8.0
India    2.0
Italy    NaN
UK       4.0
USSR     NaN
dtype: float64

# 2. DataFrames

DataFrames are the pillars of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [20]:
from numpy.random import randn
np.random.seed(101)

In [23]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='1 2 3 4'.split())
df

          1         2         3         4
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

### Selection and Indexing

Various methods to grab data from a DataFrame

In [25]:
df['2']

A    0.196800
B   -0.156598
C   -0.610259
D   -0.479448
E    1.862864
Name: 2, dtype: float64

In [26]:
df[['3','4']]

          3         4
A -1.136645  0.000366
B -0.031579  0.649826
C -0.755325 -0.346419
D  0.558769  1.024810
E -1.133817  0.610478

In [28]:
type(df['1'])

pandas.core.series.Series

 **Creating a new column:**

In [30]:
df['new'] = df['1'] + df['3']
df

          1         2         3         4       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [31]:
# Removing columns

df.drop('new',axis=1)

          1         2         3         4
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [33]:
# Not inplace unless specified!

df

          1         2         3         4       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [34]:
df.drop('new',axis=1,inplace=True)
df

          1         2         3         4
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

**Another way to drop**

In [35]:
df.drop('E',axis=0)

          1         2         3         4
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [36]:
# Selecting rows

df.loc['B']

1    1.025984
2   -0.156598
3   -0.031579
4    0.649826
Name: B, dtype: float64

In [39]:
# Selecting based on position 

df.iloc[1]

1    1.025984
2   -0.156598
3   -0.031579
4    0.649826
Name: B, dtype: float64

In [40]:
df.loc['B','3']

-0.031579143908112575

In [41]:
df.loc[['A','B'],['2','4']]

          2         4
A  0.196800  0.000366
B -0.156598  0.649826

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [42]:
df

          1         2         3         4
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [43]:
df>0

       1      2      3      4
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [44]:
df[df>0]

          1         2         3         4
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [45]:
df[df['1']>0]

          1         2         3         4
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [46]:
df[df['1']>0]['3']

B   -0.031579
C   -0.755325
D    0.558769
Name: 3, dtype: float64

In [47]:
df[df['1']>0][['3','2']]

          3         2
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

In [57]:
# For two conditions, use | and & with parenthesis:

df[(df['1']>0) & (df['1'] > 1)]

          1         2         3         4
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419

In [58]:
df

          1         2         3         4
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [59]:
# Reset to default 0,1...n index
df.reset_index()

  index         1         2         3         4
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [60]:
newind = 'CA NY WY OR CO'.split()

In [61]:
df['States'] = newind

In [62]:
df

          1         2         3         4 States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [63]:
df.set_index('States')

               1         2         3         4
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [64]:
df

          1         2         3         4 States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [65]:
df.set_index('States',inplace=True)
df

               1         2         3         4
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

### Multi-Index and Index Hierarchy

In [69]:
# Index Levels

outside = ['Group1','Group1','Group1','Group2','Group2','Group2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [70]:
hier_index

MultiIndex(levels=[['Group1', 'Group2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [71]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

                 A         B
Group1 1 -1.382920  1.482495
       2  0.961458 -2.141212
       3  0.992573  1.192241
Group2 1 -1.046780  1.292765
       2 -1.467514 -0.494095
       3 -0.162535  0.485809

In [72]:
df.loc['Group1']

          A         B
1 -1.382920  1.482495
2  0.961458 -2.141212
3  0.992573  1.192241

In [73]:
df.loc['Group1'].loc[1]

A   -1.382920
B    1.482495
Name: 1, dtype: float64

In [74]:
df.index.names

FrozenList([None, None])

In [76]:
df.index.names = ['Group','Num']
df

                   A         B
Group  Num
Group1 1   -1.382920  1.482495
       2    0.961458 -2.141212
       3    0.992573  1.192241
Group2 1   -1.046780  1.292765
       2   -1.467514 -0.494095
       3   -0.162535  0.485809

In [77]:
df.xs('Group1')

            A         B
Num
1   -1.382920  1.482495
2    0.961458 -2.141212
3    0.992573  1.192241

In [78]:
df.xs(['Group1',1])

A   -1.382920
B    1.482495
Name: (Group1, 1), dtype: float64

In [79]:
df.xs(1,level='Num')

              A         B
Group
Group1 -1.38292  1.482495
Group2 -1.04678  1.292765

# 3. Missing Data

A few convenient methods to deal with Missing Data in pandas:

In [81]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [82]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [83]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [84]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [85]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [88]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3